## DATA PREPARATION

### GETTING DATA FROM THE SOURCES

In [1]:
# Import requisite libraries
import pyodbc
from dotenv import dotenv_values
from dotenv import load_dotenv
import warnings 
warnings.filterwarnings('ignore')
import os
import requests
from io import StringIO
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

#### DATASET HOSTED AT A GITHUB REPOSITORY

In [2]:
# Github repo url link
url = 'https://raw.githubusercontent.com/Azubi-Africa/Career_Accelerator_LP1-Data_Analysis/main/startup_funding2018.csv'

# Reading data from the Github repo link
data1 = pd.read_csv(url)

data1.tail(5)

,Company Name,Industry,Round/Series,Amount,Location,About Company
521,Udaan,"B2B, Business Development, Internet, Marketplace",Series C,225000000,"Bangalore, Karnataka, India","Udaan is a B2B trade platform, designed specif..."
522,Happyeasygo Group,"Tourism, Travel",Series A,—,"Haryana, Haryana, India",HappyEasyGo is an online travel domain.
523,Mombay,"Food and Beverage, Food Delivery, Internet",Seed,7500,"Mumbai, Maharashtra, India",Mombay is a unique opportunity for housewives ...
524,Droni Tech,Information Technology,Seed,"₹35,000,000","Mumbai, Maharashtra, India",Droni Tech manufacture UAVs and develop softwa...
525,Netmeds,"Biotechnology, Health Care, Pharmaceutical",Series C,35000000,"Chennai, Tamil Nadu, India",Welcome to India's most convenient pharmacy!

In [3]:
#Saving the dataset
data1.to_csv('../Datasets/startup_funding2018.csv', index=False)

#### SQL SERVER DATASETS

In [4]:
# Load environment variables from .env file into a dictionary
environment_variables = dotenv_values("../.env")

# Get the values for the credentials you set in the '.env' file
server    = environment_variables.get("SERVER")
database  = environment_variables.get("DATABASE")
username  = environment_variables.get("USERNAME")
password  = environment_variables.get("PASSWORD")

connection_string = f"DRIVER={{SQL Server}};SERVER={server};DATABASE={database};UID={username};PWD={password};MARS_Connection=yes;MinProtocolVersion=TLSv1.2;"

# Establish a connection to the DAPS Project database using the PyODBC library
cnxn = pyodbc.connect(connection_string)

In [5]:
# Querying data from a DAP database table
query1 = "SELECT * FROM dbo.LP1_startup_funding2020"

data3 = pd.read_sql(query1, cnxn)

data3.tail(5)

,Company_Brand,Founded,HeadQuarter,Sector,What_it_does,Founders,Investor,Amount,Stage,column10
1050,Leverage Edu,NaN,Delhi,Edtech,AI enabled marketplace that provides career gu...,Akshay Chaturvedi,"DSG Consumer Partners, Blume Ventures",1500000.0,None,None
1051,EpiFi,NaN,None,Fintech,It offers customers with a single interface fo...,"Sujith Narayanan, Sumit Gwalani","Sequoia India, Ribbit Capital",13200000.0,Seed Round,None
1052,Purplle,2012.0,Mumbai,Cosmetics,Online makeup and beauty products retailer,"Manish Taneja, Rahul Dash",Verlinvest,8000000.0,None,None
1053,Shuttl,2015.0,Delhi,Transport,App based bus aggregator serice,"Amit Singh, Deepanshu Malviya",SIG Global India Fund LLP.,8043000.0,Series C,None
1054,Pando,2017.0,Chennai,Logitech,Networked logistics management software,"Jayakrishnan, Abhijeet Manohar",Chiratae Ventures,9000000.0,Series A,None

In [6]:
# Saving the dataframe
data3.to_csv('../Datasets/startup_funding2020.csv', index=False)

In [7]:
# Querying data from another DAP database table
query2 = "SELECT * FROM dbo.LP1_startup_funding2021"

data4 = pd.read_sql(query2, cnxn)

data4.tail(5)

,Company_Brand,Founded,HeadQuarter,Sector,What_it_does,Founders,Investor,Amount,Stage
1204,Gigforce,2019.0,Gurugram,Staffing & Recruiting,A gig/on-demand staffing company.,"Chirag Mittal, Anirudh Syal",Endiya Partners,$3000000,Pre-series A
1205,Vahdam,2015.0,New Delhi,Food & Beverages,VAHDAM is among the world’s first vertically i...,Bala Sarda,IIFL AMC,$20000000,Series D
1206,Leap Finance,2019.0,Bangalore,Financial Services,International education loans for high potenti...,"Arnav Kumar, Vaibhav Singh",Owl Ventures,$55000000,Series C
1207,CollegeDekho,2015.0,Gurugram,EdTech,"Collegedekho.com is Student’s Partner, Friend ...",Ruchir Arora,"Winter Capital, ETS, Man Capital",$26000000,Series B
1208,WeRize,2019.0,Bangalore,Financial Services,India’s first socially distributed full stack ...,"Vishal Chopra, Himanshu Gupta","3one4 Capital, Kalaari Capital",$8000000,Series A

In [8]:
data4.to_csv('../Datasets/startup_funding2021.csv', index=False)

## LOADING AND EXPLORING THE DATASETS

### LOADING THE DATASETS

In [10]:
# 2018 dataset as df1
df1 = pd.read_csv('../Datasets/startup_funding2018.csv')

df1.head(5)

,Company Name,Industry,Round/Series,Amount,Location,About Company
0,TheCollegeFever,"Brand Marketing, Event Promotion, Marketing, S...",Seed,250000,"Bangalore, Karnataka, India","TheCollegeFever is a hub for fun, fiesta and f..."
1,Happy Cow Dairy,"Agriculture, Farming",Seed,"₹40,000,000","Mumbai, Maharashtra, India",A startup which aggregates milk from dairy far...
2,MyLoanCare,"Credit, Financial Services, Lending, Marketplace",Series A,"₹65,000,000","Gurgaon, Haryana, India",Leading Online Loans Marketplace in India
3,PayMe India,"Financial Services, FinTech",Angel,2000000,"Noida, Uttar Pradesh, India",PayMe India is an innovative FinTech organizat...
4,Eunimart,"E-Commerce Platforms, Retail, SaaS",Seed,—,"Hyderabad, Andhra Pradesh, India",Eunimart is a one stop solution for merchants ...

In [11]:
# 2019 dataset as df2
df2 = pd.read_csv('../Datasets/startup_funding2019.csv')

df2.head(5)

,Company/Brand,Founded,HeadQuarter,Sector,What it does,Founders,Investor,Amount($),Stage
0,Bombay Shaving,NaN,NaN,Ecommerce,Provides a range of male grooming products,Shantanu Deshpande,Sixth Sense Ventures,"$6,300,000",NaN
1,Ruangguru,2014.0,Mumbai,Edtech,A learning platform that provides topic-based ...,"Adamas Belva Syah Devara, Iman Usman.",General Atlantic,"$150,000,000",Series C
2,Eduisfun,NaN,Mumbai,Edtech,It aims to make learning fun via games.,Jatin Solanki,"Deepak Parekh, Amitabh Bachchan, Piyush Pandey","$28,000,000",Fresh funding
3,HomeLane,2014.0,Chennai,Interior design,Provides interior designing solutions,"Srikanth Iyer, Rama Harinath","Evolvence India Fund (EIF), Pidilite Group, FJ...","$30,000,000",Series D
4,Nu Genes,2004.0,Telangana,AgriTech,"It is a seed company engaged in production, pr...",Narayana Reddy Punyala,Innovation in Food and Agriculture (IFA),"$6,000,000",NaN

In [12]:
# 2020 dataset as df3
df3 = pd.read_csv('../Datasets/startup_funding2020.csv')

df3.head(5)

,Company_Brand,Founded,HeadQuarter,Sector,What_it_does,Founders,Investor,Amount,Stage,column10
0,Aqgromalin,2019.0,Chennai,AgriTech,Cultivating Ideas for Profit,"Prasanna Manogaran, Bharani C L",Angel investors,200000.0,NaN,NaN
1,Krayonnz,2019.0,Bangalore,EdTech,An academy-guardian-scholar centric ecosystem ...,"Saurabh Dixit, Gurudutt Upadhyay",GSF Accelerator,100000.0,Pre-seed,NaN
2,PadCare Labs,2018.0,Pune,Hygiene management,Converting bio-hazardous waste to harmless waste,Ajinkya Dhariya,Venture Center,NaN,Pre-seed,NaN
3,NCOME,2020.0,New Delhi,Escrow,Escrow-as-a-service platform,Ritesh Tiwari,"Venture Catalysts, PointOne Capital",400000.0,NaN,NaN
4,Gramophone,2016.0,Indore,AgriTech,Gramophone is an AgTech platform enabling acce...,"Ashish Rajan Singh, Harshit Gupta, Nishant Mah...","Siana Capital Management, Info Edge",340000.0,NaN,NaN

In [13]:
# 2021 dataset as df4
df4 = pd.read_csv('../Datasets/startup_funding2021.csv')

df4.head(5)

,Company_Brand,Founded,HeadQuarter,Sector,What_it_does,Founders,Investor,Amount,Stage
0,Unbox Robotics,2019.0,Bangalore,AI startup,Unbox Robotics builds on-demand AI-driven ware...,"Pramod Ghadge, Shahid Memon","BEENEXT, Entrepreneur First","$1,200,000",Pre-series A
1,upGrad,2015.0,Mumbai,EdTech,UpGrad is an online higher education platform.,"Mayank Kumar, Phalgun Kompalli, Ravijot Chugh,...","Unilazer Ventures, IIFL Asset Management","$120,000,000",NaN
2,Lead School,2012.0,Mumbai,EdTech,LEAD School offers technology based school tra...,"Smita Deorah, Sumeet Mehta","GSV Ventures, Westbridge Capital","$30,000,000",Series D
3,Bizongo,2015.0,Mumbai,B2B E-commerce,Bizongo is a business-to-business online marke...,"Aniket Deb, Ankit Tomar, Sachin Agrawal","CDC Group, IDG Capital","$51,000,000",Series C
4,FypMoney,2021.0,Gurugram,FinTech,"FypMoney is Digital NEO Bank for Teenagers, em...",Kapil Banwari,"Liberatha Kallat, Mukesh Yadav, Dinesh Nagpal","$2,000,000",Seed

### EXPLORING THE DATASETS

#### 2018 DATASET

In [14]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 526 entries, 0 to 525
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Company Name   526 non-null    object
 1   Industry       526 non-null    object
 2   Round/Series   526 non-null    object
 3   Amount         526 non-null    object
 4   Location       526 non-null    object
 5   About Company  526 non-null    object
dtypes: object(6)
memory usage: 24.8+ KB

In [15]:
df1.describe()

,Company Name,Industry,Round/Series,Amount,Location,About Company
count,526,526,526,526,526,526
unique,525,405,21,198,50,524
top,TheCollegeFever,—,Seed,—,"Bangalore, Karnataka, India","TheCollegeFever is a hub for fun, fiesta and f..."
freq,2,30,280,148,102,2

In [16]:
# Checking if '—' exists in all the columns
columns_to_check = ['Company Name', 'Industry', 'Round/Series', 'Amount', 'Location', 'About Company']
for column_name in columns_to_check:
    is_in_column = '—' in df1[column_name].values
    if is_in_column:
        print("'—' exists in column", column_name)
    else:
        print("'—' does not exist in column", column_name)

'—' does not exist in column Company Name
'—' exists in column Industry
'—' does not exist in column Round/Series
'—' exists in column Amount
'—' does not exist in column Location
'—' does not exist in column About Company

In [17]:
# Checking the number of occurrences of the '—' character in columns where it exists
print(df1.Industry.value_counts()['—'])

print('\n')

print(df1.Amount.value_counts()['—'])

30


148

####

#### 2019 DATASET

In [18]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 89 entries, 0 to 88
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Company/Brand  89 non-null     object
 1   Founded        60 non-null     float64
 2   HeadQuarter    70 non-null     object
 3   Sector         84 non-null     object
 4   What it does   89 non-null     object
 5   Founders       86 non-null     object
 6   Investor       89 non-null     object
 7   Amount($)      89 non-null     object
 8   Stage          43 non-null     object
dtypes: float64(1), object(8)
memory usage: 6.4+ KB

In [19]:
df2.describe()

           Founded
count    60.000000
mean   2014.533333
std       2.937003
min    2004.000000
25%    2013.000000
50%    2015.000000
75%    2016.250000
max    2019.000000

#### 2020 DATASET

In [20]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1055 entries, 0 to 1054
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Company_Brand  1055 non-null   object
 1   Founded        842 non-null    float64
 2   HeadQuarter    961 non-null    object
 3   Sector         1042 non-null   object
 4   What_it_does   1055 non-null   object
 5   Founders       1043 non-null   object
 6   Investor       1017 non-null   object
 7   Amount         801 non-null    float64
 8   Stage          591 non-null    object
 9   column10       2 non-null      object
dtypes: float64(2), object(8)
memory usage: 82.6+ KB

In [21]:
df3.describe()

           Founded        Amount
count   842.000000  8.010000e+02
mean   2015.363420  1.130430e+08
std       4.097909  2.476635e+09
min    1973.000000  1.270000e+04
25%    2014.000000  1.000000e+06
50%    2016.000000  3.000000e+06
75%    2018.000000  1.100000e+07
max    2020.000000  7.000000e+10

#### 2021 DATASET

In [22]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1209 entries, 0 to 1208
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Company_Brand  1209 non-null   object
 1   Founded        1208 non-null   float64
 2   HeadQuarter    1208 non-null   object
 3   Sector         1209 non-null   object
 4   What_it_does   1209 non-null   object
 5   Founders       1205 non-null   object
 6   Investor       1147 non-null   object
 7   Amount         1206 non-null   object
 8   Stage          781 non-null    object
dtypes: float64(1), object(8)
memory usage: 85.1+ KB

In [23]:
df4.describe()

           Founded
count  1208.000000
mean   2016.655629
std       4.517364
min    1963.000000
25%    2015.000000
50%    2018.000000
75%    2020.000000
max    2021.000000

### DATA CLEANING

#### 2018 DATASET

In [24]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 526 entries, 0 to 525
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Company Name   526 non-null    object
 1   Industry       526 non-null    object
 2   Round/Series   526 non-null    object
 3   Amount         526 non-null    object
 4   Location       526 non-null    object
 5   About Company  526 non-null    object
dtypes: object(6)
memory usage: 24.8+ KB

In [25]:
# Add a Year column
year = 2018
df1['Year'] = year

In [26]:
# Create Headquarters column
df1['Headquarters'] = df1.Location.str.split().str.get(0)
df1['Headquarters']

0      Bangalore,
1         Mumbai,
2        Gurgaon,
3          Noida,
4      Hyderabad,
          ...
521    Bangalore,
522      Haryana,
523       Mumbai,
524       Mumbai,
525      Chennai,
Name: Headquarters, Length: 526, dtype: object

In [27]:
# Creat Sector column
df1['Sector']= df1.Industry.str.split().str.get(-1)
df1['Sector']

0           Ticketing
1             Farming
2         Marketplace
3             FinTech
4                SaaS
            ...
521       Marketplace
522            Travel
523          Internet
524        Technology
525    Pharmaceutical
Name: Sector, Length: 526, dtype: object

In [28]:
# Rename some columns
df1.rename(columns={'Company Name': 'Company_Name', 'Round/Series': 'Stage', 'About Company': 'About'}, inplace=True)
df1.tail(5)

,Company_Name,Industry,Stage,Amount,Location,About,Year,Headquarters,Sector
521,Udaan,"B2B, Business Development, Internet, Marketplace",Series C,225000000,"Bangalore, Karnataka, India","Udaan is a B2B trade platform, designed specif...",2018,"Bangalore,",Marketplace
522,Happyeasygo Group,"Tourism, Travel",Series A,—,"Haryana, Haryana, India",HappyEasyGo is an online travel domain.,2018,"Haryana,",Travel
523,Mombay,"Food and Beverage, Food Delivery, Internet",Seed,7500,"Mumbai, Maharashtra, India",Mombay is a unique opportunity for housewives ...,2018,"Mumbai,",Internet
524,Droni Tech,Information Technology,Seed,"₹35,000,000","Mumbai, Maharashtra, India",Droni Tech manufacture UAVs and develop softwa...,2018,"Mumbai,",Technology
525,Netmeds,"Biotechnology, Health Care, Pharmaceutical",Series C,35000000,"Chennai, Tamil Nadu, India",Welcome to India's most convenient pharmacy!,2018,"Chennai,",Pharmaceutical

In [29]:
# Drop Industry and Location columns
df1 = df1.drop(['Industry', 'Location'], axis=1)
df1.tail(5)

,Company_Name,Stage,Amount,About,Year,Headquarters,Sector
521,Udaan,Series C,225000000,"Udaan is a B2B trade platform, designed specif...",2018,"Bangalore,",Marketplace
522,Happyeasygo Group,Series A,—,HappyEasyGo is an online travel domain.,2018,"Haryana,",Travel
523,Mombay,Seed,7500,Mombay is a unique opportunity for housewives ...,2018,"Mumbai,",Internet
524,Droni Tech,Seed,"₹35,000,000",Droni Tech manufacture UAVs and develop softwa...,2018,"Mumbai,",Technology
525,Netmeds,Series C,35000000,Welcome to India's most convenient pharmacy!,2018,"Chennai,",Pharmaceutical

In [30]:
# View unique values in the Amount column
df1.Amount.unique()

array(['250000', '₹40,000,000', '₹65,000,000', '2000000', '—', '1600000',
       '₹16,000,000', '₹50,000,000', '₹100,000,000', '150000', '1100000',
       '₹500,000', '6000000', '650000', '₹35,000,000', '₹64,000,000',
       '₹20,000,000', '1000000', '5000000', '4000000', '₹30,000,000',
       '2800000', '1700000', '1300000', '₹5,000,000', '₹12,500,000',
       '₹15,000,000', '500000', '₹104,000,000', '₹45,000,000', '13400000',
       '₹25,000,000', '₹26,400,000', '₹8,000,000', '₹60,000', '9000000',
       '100000', '20000', '120000', '₹34,000,000', '₹342,000,000',
       '$143,145', '₹600,000,000', '$742,000,000', '₹1,000,000,000',
       '₹2,000,000,000', '$3,980,000', '$10,000', '₹100,000',
       '₹250,000,000', '$1,000,000,000', '$7,000,000', '$35,000,000',
       '₹550,000,000', '$28,500,000', '$2,000,000', '₹240,000,000',
       '₹120,000,000', '$2,400,000', '$30,000,000', '₹2,500,000,000',
       '$23,000,000', '$150,000', '$11,000,000', '₹44,000,000',
       '$3,240,000', '₹60,000,000', '$540,000,000', '₹650,000,000',
       '₹1,600,000,000', '$900,000', '$10,000,000', '$1,500,000',
       '₹70,000,000', '$1,000,000', '$5,000,000', '$14,000,000',
       '₹102,500,000', '$100,000,000', '₹1,200,000', '₹5,200,000,000',
       '$800,000', '$1,041,000', '$100,000', '$15,000', '1400000',
       '1200000', '2200000', '1800000', '3600000', '₹9,500,000', '300000',
       '6830000', '200000', '₹150,000,000', '4300000', '364846', '400000',
       '1500000', '₹7,000,000', '₹1,400,000', '₹10,000,000',
       '₹22,500,000', '13200000', '50000', '₹140,200,000', '3000000',
       '1250000', '180000', '₹19,200,000', '₹103,000,000', '4200000',
       '175000', '1450000', '₹200,000', '4500000', '600000',
       '₹16,600,000', '₹12,000,000', '15000000', '₹33,000,000', '125000',
       '130000', '₹34,900,000', '₹72,000,000', '17200000', '₹32,000,000',
       '3500000', '₹135,000,000', '12000000', '$40,000,000', '$1,100,000',
       '$50,000,000', '₹1,540,000,000', '$3,000,000', '$6,000,000',
       '₹140,000,000', '$41,900,000', '₹1,410,000,000', '$3,530,000',
       '$200,000', '$3,300,000', '₹580,000,000', '₹36,000,000',
       '₹340,000,000', '$210,000,000', '$37,680,000', '$250,000',
       '$20,000', '₹510,000,000', '₹2,200,000,000', '22000000', '70000',
       '10000000', '₹15,392,000,000', '₹20,000,000,000', '₹4,000,000,000',
       '185000000', '65000000', '₹165,000,000', '700000', '30000000',
       '₹210,000,000', '210000000', '₹2,029,600,000', '75000000',
       '₹80,000,000', '1760000', '2700000', '₹280,000,000',
       '₹800,000,000', '750000', '2500000', '80000000', '25000000',
       '₹730,000,000', '₹400,000,000', '3700000', '5600000',
       '₹260,000,000', '99230000', '70000000', '40000', '550000',
       '50000000', '365000000', '₹8,750,000', '₹78,000,000', '28000000',
       '₹264,000,000', '100000000', '₹1,130,000,000', '₹810,000,000',
       '₹1,400,000,000', '14900000', '225000000', '7500', '35000000'],
      dtype=object)

In [31]:
# Remove comma from all rows
df1['Amount'] = df1['Amount'].str.replace(',', '')
df1.Amount.head(5)

0       250000
1    ₹40000000
2    ₹65000000
3      2000000
4            —
Name: Amount, dtype: object

In [32]:
# Function to convert rupees to dollars
def convert_to_dollars(Amount):
    if Amount.startswith('₹'):
        return float(Amount[1:]) * 0.0146
    else:
        return Amount
 
# Apply the conversion function to the Amount column
df1['Amount'] = df1['Amount'].apply(convert_to_dollars)
df1.Amount.head(5)

0      250000
1    584000.0
2    949000.0
3     2000000
4           —
Name: Amount, dtype: object

In [33]:
# Another view at outcome of comma removal
df1.Amount.unique()

array(['250000', 584000.0, 949000.0, '2000000', '—', '1600000', 233600.0,
       730000.0, 1460000.0, '150000', '1100000', 7300.0, '6000000',
       '650000', 511000.0, 934400.0, 292000.0, '1000000', '5000000',
       '4000000', 438000.0, '2800000', '1700000', '1300000', 73000.0,
       182500.0, 219000.0, '500000', 1518400.0, 657000.0, '13400000',
       365000.0, 385440.0, 116800.0, 876.0, '9000000', '100000', '20000',
       '120000', 496400.0, 4993200.0, '$143145', 8760000.0, '$742000000',
       14600000.0, 29200000.0, '$3980000', '$10000', 1460.0, 3650000.0,
       '$1000000000', '$7000000', '$35000000', 8030000.0, '$28500000',
       '$2000000', 3504000.0, 1752000.0, '$2400000', '$30000000',
       36500000.0, '$23000000', '$150000', '$11000000', 642400.0,
       '$3240000', 876000.0, '$540000000', 9490000.0, 23360000.0,
       '$900000', '$10000000', '$1500000', 1022000.0, '$1000000',
       '$5000000', '$14000000', 1496500.0, '$100000000', 17520.0,
       75920000.0, '$800000', '$1041000', '$100000', '$15000', '1400000',
       '1200000', '2200000', '1800000', '3600000', 138700.0, '300000',
       '6830000', '200000', 2190000.0, '4300000', '364846', '400000',
       '1500000', 102200.0, 20440.0, 146000.0, 328500.0, '13200000',
       '50000', 2046920.0, '3000000', '1250000', '180000', 280320.0,
       1503800.0, '4200000', '175000', '1450000', 2920.0, '4500000',
       '600000', 242360.0, 175200.0, '15000000', 481800.0, '125000',
       '130000', 509540.0, 1051200.0, '17200000', 467200.0, '3500000',
       1971000.0, '12000000', '$40000000', '$1100000', '$50000000',
       22484000.0, '$3000000', '$6000000', 2044000.0, '$41900000',
       20586000.0, '$3530000', '$200000', '$3300000', 8468000.0, 525600.0,
       4964000.0, '$210000000', '$37680000', '$250000', '$20000',
       7446000.0, 32120000.0, '22000000', '70000', '10000000',
       224723200.0, 292000000.0, 58400000.0, '185000000', '65000000',
       2409000.0, '700000', '30000000', 3066000.0, '210000000',
       29632160.0, '75000000', 1168000.0, '1760000', '2700000', 4088000.0,
       11680000.0, '750000', '2500000', '80000000', '25000000',
       10658000.0, 5840000.0, '3700000', '5600000', 3796000.0, '99230000',
       '70000000', '40000', '550000', '50000000', '365000000', 127750.0,
       1138800.0, '28000000', 3854400.0, '100000000', 16498000.0,
       11826000.0, 20440000.0, '14900000', '225000000', '7500',
       '35000000'], dtype=object)

In [34]:
# Function to clean the Amount column

def clean_column(Amount):
    # Convert the series to string type
    Amount = Amount.astype(str)
    
    # Remove characters: $, space, .
    Amount = Amount.str.replace('[$ .]', '')

    Amount = Amount.str.replace('$', '')

    # Remove single quotation marks surrounding numbers
    Amount = Amount.str.replace(r"'(\d+)'", r'\1')

    # Replace '—' with 0
    Amount = Amount.str.replace('—', '0')

    return Amount

# Using the clean_column function
df1['Amount'] = clean_column(df1['Amount'])
df1['Amount'].head(5)

0      250000
1    584000.0
2    949000.0
3     2000000
4           0
Name: Amount, dtype: object

In [35]:
# Convert the Amount column to float data type
df1['Amount'] = df1['Amount'].astype(float)
print(df1['Amount'].dtype)

float64

In [36]:
# Fill null values in the Sector column with its mode value
df1['Sector'] = df1['Sector'].fillna(df1['Sector'].mode()[0])

In [37]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 526 entries, 0 to 525
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Company_Name  526 non-null    object
 1   Stage         526 non-null    object
 2   Amount        526 non-null    float64
 3   About         526 non-null    object
 4   Year          526 non-null    int64
 5   Headquarters  526 non-null    object
 6   Sector        526 non-null    object
dtypes: float64(1), int64(1), object(5)
memory usage: 28.9+ KB

In [38]:
df1.describe().T

,count,mean,std,min,25%,50%,75%,max
Amount,526.0,1.262695e+07,6.646323e+07,0.0,0.0,584000.0,3000000.0,1.000000e+09
Year,526.0,2.018000e+03,0.000000e+00,2018.0,2018.0,2018.0,2018.0,2.018000e+03

In [39]:
df1.duplicated().sum()

1

#### 2019 DATASET

In [40]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 89 entries, 0 to 88
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Company/Brand  89 non-null     object
 1   Founded        60 non-null     float64
 2   HeadQuarter    70 non-null     object
 3   Sector         84 non-null     object
 4   What it does   89 non-null     object
 5   Founders       86 non-null     object
 6   Investor       89 non-null     object
 7   Amount($)      89 non-null     object
 8   Stage          43 non-null     object
dtypes: float64(1), object(8)
memory usage: 6.4+ KB

In [41]:
# Add a Year column
year = 2019
df2['Year'] = year

In [42]:
df2.head(5)

,Company/Brand,Founded,HeadQuarter,Sector,What it does,Founders,Investor,Amount($),Stage,Year
0,Bombay Shaving,NaN,NaN,Ecommerce,Provides a range of male grooming products,Shantanu Deshpande,Sixth Sense Ventures,"$6,300,000",NaN,2019
1,Ruangguru,2014.0,Mumbai,Edtech,A learning platform that provides topic-based ...,"Adamas Belva Syah Devara, Iman Usman.",General Atlantic,"$150,000,000",Series C,2019
2,Eduisfun,NaN,Mumbai,Edtech,It aims to make learning fun via games.,Jatin Solanki,"Deepak Parekh, Amitabh Bachchan, Piyush Pandey","$28,000,000",Fresh funding,2019
3,HomeLane,2014.0,Chennai,Interior design,Provides interior designing solutions,"Srikanth Iyer, Rama Harinath","Evolvence India Fund (EIF), Pidilite Group, FJ...","$30,000,000",Series D,2019
4,Nu Genes,2004.0,Telangana,AgriTech,"It is a seed company engaged in production, pr...",Narayana Reddy Punyala,Innovation in Food and Agriculture (IFA),"$6,000,000",NaN,2019

In [43]:
# Check number of unique values in Founded column
df2['Founded'].unique()

array([  nan, 2014., 2004., 2013., 2010., 2018., 2019., 2017., 2011.,
       2015., 2016., 2012., 2008.])

In [44]:
# Create function to fill missing values of the Founded with its mode
def fill_null_with_mode(df, column_name):
    mode_value = df[column_name].mode()  # Calculate the mode of the column
    if not mode_value.empty:
        mode_value = mode_value.iloc[0]  # Get mode value
        df[column_name].fillna(mode_value, inplace=True)  # Fill null values with the mode


fill_null_with_mode(df2, 'Founded')
df2.Founded.isna().sum()

0

In [45]:
# Rename some columns
df2.rename(columns={'Company/Brand': 'Company_Name',
                    'HeadQuarter': 'Headquarters',
                    'What it does': 'About',
                    'Amount($)': 'Amount'},
           inplace=True)
df2.tail(5)

,Company_Name,Founded,Headquarters,Sector,About,Founders,Investor,Amount,Stage,Year
84,Infra.Market,2015.0,Mumbai,Infratech,It connects client requirements to their suppl...,"Aaditya Sharda, Souvik Sengupta","Tiger Global, Nexus Venture Partners, Accel Pa...","$20,000,000",Series A,2019
85,Oyo,2013.0,Gurugram,Hospitality,Provides rooms for comfortable stay,Ritesh Agarwal,"MyPreferred Transformation, Avendus Finance, S...","$693,000,000",NaN,2019
86,GoMechanic,2016.0,Delhi,Automobile & Technology,Find automobile repair and maintenance service...,"Amit Bhasin, Kushal Karwa, Nitin Rana, Rishabh...",Sequoia Capital,"$5,000,000",Series B,2019
87,Spinny,2015.0,Delhi,Automobile,Online car retailer,"Niraj Singh, Ramanshu Mahaur, Ganesh Pawar, Mo...","Norwest Venture Partners, General Catalyst, Fu...","$50,000,000",NaN,2019
88,Ess Kay Fincorp,2015.0,Rajasthan,Banking,Organised Non-Banking Finance Company,Rajendra Setia,"TPG, Norwest Venture Partners, Evolvence India","$33,000,000",NaN,2019

In [46]:
# Fill null values in the Sector column with its mode value
df2['Sector'] = df2['Sector'].fillna(df2['Sector'].mode()[0])

In [47]:
# Check number of unique values in Company_Name column
df2['Company_Name'].nunique()

87

In [48]:
# Check number of unique values in Founders column
df2['Founders'].nunique()

85

In [49]:
# View unique values in Amount column
df2['Amount'].unique()

array(['$6,300,000', '$150,000,000', '$28,000,000', '$30,000,000',
       '$6,000,000', 'Undisclosed', '$1,000,000', '$20,000,000',
       '$275,000,000', '$22,000,000', '$5,000,000', '$140,500',
       '$540,000,000', '$15,000,000', '$182,700', '$12,000,000',
       '$11,000,000', '$15,500,000', '$1,500,000', '$5,500,000',
       '$2,500,000', '$140,000', '$230,000,000', '$49,400,000',
       '$32,000,000', '$26,000,000', '$150,000', '$400,000', '$2,000,000',
       '$100,000,000', '$8,000,000', '$100,000', '$50,000,000',
       '$120,000,000', '$4,000,000', '$6,800,000', '$36,000,000',
       '$5,700,000', '$25,000,000', '$600,000', '$70,000,000',
       '$60,000,000', '$220,000', '$2,800,000', '$2,100,000',
       '$7,000,000', '$311,000,000', '$4,800,000', '$693,000,000',
       '$33,000,000'], dtype=object)

In [50]:
# Function to clean the Amount column

def clean_column(Amount):
    # Remove space,
    Amount = Amount.str.replace(' ', '')

     # Remove comma symbol
    Amount = Amount.str.replace(',', '')
    
    # Remove dollar symbol
    Amount = Amount.str.replace('$', '')

    # Remove single quotation marks surrounding numbers
    Amount = Amount.str.replace(r"'(\d+)'", r'\1')
    
    # Replace 'Undisclosed' with '0'
    Amount = Amount.str.replace('Undisclosed', '0')


    return Amount

# Using the clean_column function
df2['Amount'] = clean_column(df2['Amount'])
df2['Amount'].head(5)

0      6300000
1    150000000
2     28000000
3     30000000
4      6000000
Name: Amount, dtype: object

In [51]:
# Convert the Amount column to float data type
df2['Amount'] = df2['Amount'].astype(float)
df2['Amount'].dtype

dtype('float64')

In [52]:
# Fill null values in the Stage column with its mode value
df2['Stage'] = df2['Stage'].fillna(df2['Stage'].mode()[0])

In [53]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 89 entries, 0 to 88
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Company_Name  89 non-null     object
 1   Founded       89 non-null     float64
 2   Headquarters  70 non-null     object
 3   Sector        89 non-null     object
 4   About         89 non-null     object
 5   Founders      86 non-null     object
 6   Investor      89 non-null     object
 7   Amount        89 non-null     float64
 8   Stage         89 non-null     object
 9   Year          89 non-null     int64
dtypes: float64(2), int64(1), object(7)
memory usage: 7.1+ KB

In [54]:
df2.describe().T

,count,mean,std,min,25%,50%,75%,max
Founded,89.0,2.014685e+03,2.414895e+00,2004.0,2014.0,2015.0,2015.0,2019.0
Amount,89.0,3.748801e+07,1.038746e+08,0.0,1000000.0,5500000.0,26000000.0,693000000.0
Year,89.0,2.019000e+03,0.000000e+00,2019.0,2019.0,2019.0,2019.0,2019.0

In [55]:
df2.duplicated().sum()

0

#### SOURCING THE DATASETS  
The datasets were sourced from a github repository, a onedrive account, and a SQL server database.  
The data at a github repo was read directly using the web url and the dataframe saved as a csv file.  
The data at a onedrive account was downloaded manually due to permission issues.  
The datasets hosted by a SQL server database was queried, and the respective dataframes saved as single files in csv format.

#### LOADING THE DATASETS  
All four (4) datasets from the three (3) sources were loaded one at a time.

#### EXPLORING THE DATASETS  
 * 2018 DATASET  
There are 526 records captured by the dataframe.
Some column names were very different from those in the other datasets.
All columns were of object data type which made the descriptive statistics return only count values.
It would seem that there are no null values present in this dataset, but the dash character, '—', exists in the "Industry" and "Amount" columns by 30 and 148 instances respectively.
There were no "Founded" and "Investor" column in the raw dataset.

 * 2019 DATASET
This dataset contained just 89 records.
Even though the column names were closer to those in the 2020 and 2021 datasets, they still need some editing.
Null values exist in five (5) of the nine (9) columns.
All columns were in their appropriate data types except for the "Founded" and "Amount" columns.
The descriptive statistics shows that the minimum value in the "Founded" column is 2004. A start-up should be a company that has been operating for five (5) years or less (a general consensus among experts), so the dataset would be trimmed on that basis.

 * 2020 DATASET
1055 records were found in this dataset.
Of all the columns, only the "Company_Brand" column had no missing values.
The "column10" looks suspiciously under-populated, which could be an indicator of an irrelevant column. This would be investigated during the data cleaning stage.
The descriptive statistics shows that the minimum value for the "Founded" column is 1973. This is definitely too old to be a start-up no matter how you look at it. Once again, the dataset will be trimmed on the basis of their year founded.
Columns with wrong data types will be corrected during the data cleaning stage.

* 2021 DATASET
There are 1209 rows of data in this dataset.
It looks like having the "Founded" and "Amount" columns in the wrong data type was a trend for all the years in review.
The minimum year value looks problematic, like it was in the 2020 dataset.

### DATA CLEANING

2018 DATASET

The "Year" column was created for the 2018 dataset to maintain row uniqueness after merging all datasets into one single dataframe.  
The "Headquarters" and "Sector" columns were created based on the "Location" and "Industry" columns respectively.  
The "Company Name" and "Round/Series" had to be renamed to make them consistent column names in other datasets. The "About Company" was renamed to "About" for simplicity.  
The Location and "Industry" columns were dropped since they will be of no further use to the analytical process.  
The Amount column was in the wrong data type. But before any corrections were made, we looked at the unique values present in the column so that appropriate steps would be taken.  
After viewing the unique values present in the column, we noticed that some records were expressed in terms of rupees, some in terms of dollars, and the rest had no currency designation. We decided to assume the currency of the undesignated records as dollars since there were more records with dollars symbol than those with rupees symbol. The records with the rupees symbol were converted to their respective dollar values in order to have the entire column in terms of dollars only.  
Since the column was in the string data type, we got all non-numeric characters and symbols removed. Then, we converted the entire column into the float data type. Taking a look at the df1 (2018 dataset) dataframe, we can see that there are no null values. The "Amount" column had a mean value of about USD12,626,950 , with minimum and maximum values of USD0.0 and UDS1,000,000,000 respectively. While the "Year" column had its mean, minimum and maximum values as 2018.Duplicate values after cleaning was 1.

#### 2019 DATASET